## [181. Employees Earning More Than Their Managers](https://leetcode.com/problems/employees-earning-more-than-their-managers/)

问题难度: &clubs;

### 问题描述

`Employee`表中存储着所有雇员的信息(包括经理). 每个雇员都有一个工号`id`, 最后一列为其经理的`id`:

```
+----+-------+--------+-----------+
| Id | Name  | Salary | ManagerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
+----+-------+--------+-----------+
```

给定`Employee`表, 写一个`SQL`查询语句找出那些工资比他们经理高的员工们. 在上面的表中, 只有`Joe`的工资比他的经理高.

```
+----------+
| Employee |
+----------+
| Joe      |
+----------+
```

### 解题思路

这道题是一个考察`SQL`的题目. 需要考虑到自连接:

- 第一步: 将员工的工资和经理的工资放在同一行, 需要自己`join`一下: `select e.salary, (select salary from Employee m where e.ManagerId = m.Id)  as m.salary from Employee e`, (由于两个表名字相同, 需要使用到`mysql`中的别名)
- 第二步: 筛选出员工工资比经理高的员工: `select e_name as Employee from (select e.name as e_name, e.salary as e_salary, (select salary from Employee m where e.ManagerId = m.Id)  as m_salary from Employee e) as f where f.e_salary > f.m_salary`


### 代码

```
# Write your MySQL query statement below
select e_name as Employee from (select e.name as e_name, e.salary as e_salary, (select salary from Employee m where e.ManagerId = m.Id)  as m_salary from Employee e) as f where f.e_salary > f.m_salary
```

## [182. Duplicate Emails](https://leetcode.com/problems/duplicate-emails/)

问题难度: &clubs;

### 问题描述

写一个`SQL`查询出一个名为`Person`的表中的所有重复邮件.

```
+----+---------+
| Id | Email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+
```

例如, 针对上面的表, 应该返回下面的结果:
```
+---------+
| Email   |
+---------+
| a@b.com |
+---------+
```

**注意**: 所有邮件都是小写.

### 解题思路

直接使用`having`和`group by`相结合.

### 代码

```
# Write your MySQL query statement below
select Email from Person group by Email having count(Email) > 1
```

## [183. Customers Who Never Order](https://leetcode.com/problems/customers-who-never-order/)

问题难度: &clubs;

### 问题描述

假设一个网站包含两个表, `Customers`和`Orders`表, 写一个`SQL`查询找到所有从未订购过东西的客户.

`Customers`表:
```
+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
```

`Orders`表:
```
+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
```

基于上面的示例, 返回以下数据:
```
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
```

### 解题思路

可以使用到`mysql`中的`not in`, 但是很显然, 时间复杂度比较高. 

在这里, 也可以使用`Left JOIN`来进行解决.


### 代码

```
# Write your MySQL query statement below
select Name as Customers from Customers where Id not in (select distinct(CustomerId) from Orders)
```

```
# Write your MySQL query statement below
select Name as Customers from Customers left join (select CustomerId from Orders) as ods on Customers.Id = ods.CustomerId where ods.CustomerId is NULL;

```

## [184. Department Highest Salary](https://leetcode.com/problems/department-highest-salary/)

问题难度: &clubs; &clubs; &clubs;

### 问题描述

`Employee`表中存储着所有员工的信息. 每个员工有一个`ID`和工资, 还有一列为部门`id`.
```
+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
```
`Department`表存储着公司所有部门的信息.

```
+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
```
写一个`SQL`查询语句找到每个部门中工资最高的员工及对应的工资. 

针对上面的示例, `Max`有`IT`部门最高的工资, 而`Henry`有`Sales`部门最高的工资.

```
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| Sales      | Henry    | 80000  |
+------------+----------+--------+
```

### 解题思路

首先, 在`Department`表中找到每个部门最高的工资(使用`group by`和`max`)
`select Employee.DepartmentId, Employee.Name, Employee.Salary from Employee, (select DepartmentId, max(Salary) as max_salary from Employee group by DepartmentId) as e where e.DepartmentId = Employee.DepartmentId and e.max_salary=Salary;`

再将该表与`Department`表`join`一下:
`select d.Name as Department, e.Name as Employee, e.max_salary as Salary from Department d inner join(...) as e on e.DepartmentId = d.Name`

### 代码
```
# Write your MySQL query statement below
select d.Name as Department, e.Name as Employee, e.Salary from Department d inner join(select Employee.DepartmentId, Employee.Name, Employee.Salary from Employee, (select DepartmentId, max(Salary) as max_salary from Employee group by DepartmentId) as e where e.DepartmentId = Employee.DepartmentId and e.max_salary=Salary) as e on e.DepartmentId = d.Id;
```